Repository: arshubham/appcenter
Catalog: po/extra/*.po
Languages: lt

source: AppCenter
lt: Programų centras

source: Browse and manage apps
lt: Naršyti ir tvarkyti programas

source: An app store for indie and open source developers. Browse by categories or search and discover new apps. AppCenter is also used for updating your system to the latest and greatest version for new features and fixes.
lt: Programų parduotuvė, skirta savarankiškai kuriantiems ir atvirojo kodo kūrėjams. Naršykite pagal kategorijas arba ieškokite ir atraskite naujas programas. Programų centras taip pat yra naudojamas jūsų sistemos atnaujinimui į naujausias ir šauniausias versijas su naujomis ypatybėmis ir pataisymais.

source: Meson build system fixes
lt: Meson darinių sistemos pataisymai

source: Improve window state restoration
lt: Patobulinti lango būsenos atkūrimą

source: Prevent action buttons from jumping around
lt: Neleisti veiksmų mygtukams lakstyti aplinkui

source: Remove reset paid apps gsettings key
lt: Šalinti mokamų programų atstatymo gsettings raktą

source: Memory management refinements
lt: Atminties valdymo patobulinimai

source: Add conditional compilation for disabling dynamic remote homepage content
lt: Pridėti sąlyginį kompiliavimą, skirtą išjungti dinaminės saugyklos internetinio puslapio turinį

source: New translations
lt: Nauji vertimai

source: New categories: Communication, Finance, Media Production
lt: Naujos kategorijos: Komunikacija, Finansai, Medijos kūryba

source: Add Math to Science category
lt: Pridėti matematiką į mokslo kategoriją

source: Relax email address validator
lt: Atpalaiduoti el. pašto adresų tikrintoją

source: Present update availability more accurately
lt: Tiksliau pateikti atnaujinimų prieinamumą

source: Category graphics revamped
lt: Patobulinta grafikos kategorija

source: Bug fixes and improve performance.
lt: Klaidų pataisymai ir našumo patobulinimai.

source: Improve transaction success rate
lt: Patobulinti operacijos sėkmės tikimybę

source: Add Publishing to Office category
lt: Pridėti publikavimą į biuro kategoriją

source: Improve descriptions of OS Updates
lt: Patobulinti operacinės sistemos atnaujinimų aprašus

source: Various bug fixes and performance improvements
lt: Įvairūs klaidų pataisymai ir našumo patobulinimai

source: Give details for Operating System Updates
lt: Pateikti išsamesnę operacinės sistemos atnaujinimų informaciją

source: Support mouse button navigation
lt: Palaikyti naršymą pelės mygtukais

source: Fix crash caused by entries with missing packages
lt: Ištaisyti strigtį, kurią sukelia įrašai su trūkstamais paketais

source: Add capability to search by category and apply minor bug fixes.
lt: Pridėti galimybę ieškoti pagal kategorijas ir taikyti smulkių klaidų pataisymus.

source: It is now possible to search apps inside a category
lt: Dabar įmanoma ieškoti programas kategorijose

source: Prevent multiple authentication dialogs when resuming from suspend
lt: Tęsiant po pristabdymo, neleisti kelių tapatybės nustatymo dialogų

source: Search performance has beeen improved, the category name is now shown on the headbar and minor bugs have been fixed.
lt: Buvo patobulintas paieškos greitis, kategorijos pavadinimas dabar yra rodomas antraštės juostoje, be to, buvo ištaisytos smulkios klaidos.

source: Fix Steam installation
lt: Ištaisyti Steam diegimą

source: Make search asynchronous
lt: Padaryti paiešką asinchroninę

source: install;uninstall;remove;catalogue;store;apps;updates;software;
lt: įdiegti;idiegti;šalinti;salinti;pašalinti;pasalinti;katalogas;parduotuvė;parduotuve;programos;atnaujinimai;naujinimai;programinė įranga;programine iranga;

source: Check for Updates
lt: Tikrinti ar yra atnaujinimų
